In [1]:
import pandas as pd

In [17]:
d=pd.read_csv("C:\\Users\\y20cs186\\Desktop\\excel.csv")

In [18]:
k=pd.DataFrame(d)
print(k)

        name  rollno  n1  n2  n3
0      divya     186  78  18  90
1    keerthi     142  89  67  89
2  sravanthi     170  81  68  60

In [20]:
k["total"]=k["n1"]+k["n2"]+k["n3"]
k

        name  rollno  n1  n2  n3  total
0      divya     186  78  18  90    186
1    keerthi     142  89  67  89    245
2  sravanthi     170  81  68  60    209

In [22]:
k["percentage"]=k["total"]/3
k

        name  rollno  n1  n2  n3  total  percentage
0      divya     186  78  18  90    186   62.000000
1    keerthi     142  89  67  89    245   81.666667
2  sravanthi     170  81  68  60    209   69.666667

In [30]:
def grade(var):
    if var>=90:
        return "A"
    elif var>=80:
        return "B"
    elif var>=70:
        return "C"
    elif var>=60:
        return "D"
for i in range (3):
    v=k.iat[i,6]
    k.iat[i,7]=grade(v)

In [31]:
k

        name  rollno  n1  n2  n3  total  percentage grade
0      divya     186  78  18  90    186   62.000000     D
1    keerthi     142  89  67  89    245   81.666667     B
2  sravanthi     170  81  68  60    209   69.666667     D

In [39]:
k.to_csv(r"C:\\Users\\y20cs186\\Desktop\\excel.csv")